Оборудование/src/Documents/ВозвратСРемонта/ВозвратСРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратСРемонта</name>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Остатки</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Куда</name>
    <type>
      <types>CatalogRef.Субъекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьРемонта</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Оборудование/src/Documents/ВозвратСРемонта/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ВозвратСРемонта.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратСРемонта.Дата,
	|	ВозвратСРемонта.Куда,
	|	ВозвратСРемонта.Номенклатура,
	|	ВозвратСРемонта.Номер,
	|	ВозвратСРемонта.ПереченьРемонта.(
	|		НомерСтроки,
	|		ВидРемонта,
	|		Цена
	|	)
	|ИЗ
	|	Документ.ВозвратСРемонта КАК ВозвратСРемонта
	|ГДЕ
	|	ВозвратСРемонта.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПереченьРемонтаШапка = Макет.ПолучитьОбласть("ПереченьРемонтаШапка");
	ОбластьПереченьРемонта = Макет.ПолучитьОбласть("ПереченьРемонта");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПереченьРемонтаШапка);
		ВыборкаПереченьРемонта = Выборка.ПереченьРемонта.Выбрать();
		Пока ВыборкаПереченьРемонта.Следующий() Цикл
			ОбластьПереченьРемонта.Параметры.Заполнить(ВыборкаПереченьРемонта);
			ТабДок.Вывести(ОбластьПереченьРемонта, ВыборкаПереченьРемонта.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
